In [1]:
import pandas as pd
import numpy as np

In [23]:
data = pd.read_csv("/content/titanic_train.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
# Write a Pandas program to print a concise summary of the dataset

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [25]:
# Write a Pandas program to extract the column labels, shape and data types of the dataset 

print("List of Columns: ")
print(data.columns)

print("\nShape of the dataset")
print(data.shape)

print("\nType of the dataset")
print(data.dtypes)

List of Columns:
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Shape of the dataset
(891, 12)

Type of the dataset
PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [27]:
# Write a Pandas program to create a Pivot table with multiple indexes from the data set

result = pd.pivot_table(data, index=["Sex", "Age"], aggfunc=np.sum)
print(result)

                  Fare  Parch  PassengerId  Pclass  SibSp  Survived
Sex    Age
female 0.75    38.5166      2         1115       6      4         2
       1.00    26.8750      3          555       6      1         2
       2.00   259.4750      9         2278      15      9         2
       3.00    62.6542      3          419       5      4         1
       4.00   114.1417      6         2258      13      4         5
...                ...    ...          ...     ...    ...       ...
male   70.00   81.5000      1         1419       3      1         0
       70.50    7.7500      0          117       3      0         0
       71.00   84.1584      0          591       2      0         0
       74.00    7.7750      0          852       3      0         0
       80.00   30.0000      0          631       1      0         1

[145 rows x 6 columns]

In [28]:
# Write a Pandas program to create a Pivot table and find survival rate by gender on various classes. 

result = data.pivot_table('Survived', index='Sex', columns='Pclass')
print(result)

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [29]:
# Write a Pandas program to create a Pivot table and find survival rate by gender

result = data.groupby('Sex')[['Survived']].mean()
print(result)

        Survived
Sex
female  0.742038
male    0.188908

In [30]:
# Write a Pandas program to create a Pivot table and find survival rate by gender, age wise of various classes

result = data.pivot_table('Survived', index=['Sex', 'Age'], columns='Pclass')
print(result)

Pclass          1    2     3
Sex    Age
female 0.75   NaN  NaN  1.00
       1.00   NaN  NaN  1.00
       2.00   0.0  1.0  0.25
       3.00   NaN  1.0  0.00
       4.00   NaN  1.0  1.00
...           ...  ...   ...
male   70.00  0.0  0.0   NaN
       70.50  NaN  NaN  0.00
       71.00  0.0  NaN   NaN
       74.00  NaN  NaN  0.00
       80.00  1.0  NaN   NaN

[145 rows x 3 columns]

In [31]:
# Write a Pandas program to partition each of the passengers into four categories based on their age

result = pd.cut(data['Age'],[0,10,30,60,80])
print(result)

0      (10.0, 30.0]
1      (30.0, 60.0]
2      (10.0, 30.0]
3      (30.0, 60.0]
4      (30.0, 60.0]
           ...
886    (10.0, 30.0]
887    (10.0, 30.0]
888             NaN
889    (10.0, 30.0]
890    (30.0, 60.0]
Name: Age, Length: 891, dtype: category
Categories (4, interval[int64, right]): [(0, 10] < (10, 30] < (30, 60] < (60, 80]]

In [34]:
# Write a Pandas program to create a Pivot table and count survival by gender, categories wise age of various classes
result = data.pivot_table('Survived', index=['Sex', 'Age'], columns='Pclass', aggfunc='count')
print(result)

Pclass          1    2    3
Sex    Age
female 0.75   NaN  NaN  2.0
       1.00   NaN  NaN  2.0
       2.00   1.0  1.0  4.0
       3.00   NaN  1.0  1.0
       4.00   NaN  2.0  3.0
...           ...  ...  ...
male   70.00  1.0  1.0  NaN
       70.50  NaN  NaN  1.0
       71.00  2.0  NaN  NaN
       74.00  NaN  NaN  1.0
       80.00  1.0  NaN  NaN

[145 rows x 3 columns]

In [36]:
# Write a Pandas program to create a Pivot table and find survival rate by gender, age of the different categories of various classes
age = pd.cut(data['Age'], [0, 20, 55])
result = data.pivot_table('Survived', index=['Sex', age], columns='Pclass')
print(result)

Pclass                  1         2         3
Sex    Age
female (0, 20]   0.928571  1.000000  0.510638
       (20, 55]  0.968750  0.912281  0.407407
male   (0, 20]   0.571429  0.526316  0.197368
       (20, 55]  0.440000  0.054054  0.134503

In [37]:
# Write a Pandas program to create a Pivot table and find survival rate by gender, age of the different categories of various classes. 
# Add the fare as a dimension of columns and partition fare column into 2 categories based on the values present in fare columns.

fare = pd.qcut(data['Fare'],2)
age = pd.cut(data['Age'], [0, 10, 30, 60, 80])
result = data.pivot_table('Survived', index = ['Sex', 'Age'], columns = [fare,'Pclass'])
print(result)

Fare         (-0.001, 14.454]           (14.454, 512.329]
Pclass                      1    2    3                 1    2    3
Sex    Age
female 0.75               NaN  NaN  NaN               NaN  NaN  1.0
       1.00               NaN  NaN  1.0               NaN  NaN  1.0
       2.00               NaN  NaN  0.5               0.0  1.0  0.0
       3.00               NaN  NaN  NaN               NaN  1.0  0.0
       4.00               NaN  NaN  1.0               NaN  1.0  1.0
...                       ...  ...  ...               ...  ...  ...
male   70.00              NaN  0.0  NaN               0.0  NaN  NaN
       70.50              NaN  NaN  0.0               NaN  NaN  NaN
       71.00              NaN  NaN  NaN               0.0  NaN  NaN
       74.00              NaN  NaN  0.0               NaN  NaN  NaN
       80.00              NaN  NaN  NaN               1.0  NaN  NaN

[145 rows x 6 columns]

In [38]:
# Write a Pandas program to create a Pivot table and find the probability of survival by class, gender, port of embarkation

result = data.pivot_table('Survived', index=['Pclass', 'Sex','Embarked'])
print(result)

                        Survived
Pclass Sex    Embarked
1      female C         0.976744
              Q         1.000000
              S         0.958333
       male   C         0.404762
              Q         0.000000
              S         0.354430
2      female C         1.000000
              Q         1.000000
              S         0.910448
       male   C         0.200000
              Q         0.000000
              S         0.154639
3      female C         0.652174
              Q         0.727273
              S         0.375000
       male   C         0.232558
              Q         0.076923
              S         0.128302

In [39]:
# Write a Pandas program to create a Pivot table and find number of survivors and average rate grouped by gender and class

result = data.pivot_table(index='Sex', columns='Pclass', aggfunc={'Survived':sum, 'Fare':'mean'})
print(result)

              Fare                       Survived
Pclass           1          2          3        1   2   3
Sex
female  106.125798  21.970121  16.118810       91  70  72
male     67.226127  19.741782  12.661633       45  17  47

In [40]:
# Write a Pandas program to create a Pivot table and calculate number of women and men were in a particular cabin class

result = data.pivot_table(index=['Sex'], columns=['Pclass'], aggfunc='count')
print(result)

        Age          Cabin        Embarked           Fare  ... PassengerId  \
Pclass    1   2    3     1   2  3        1    2    3    1  ...           3
Sex                                                        ...
female   85  74  102    81  10  6       92   76  144   94  ...         144
male    101  99  253    95   6  6      122  108  347  122  ...         347

       SibSp           Survived           Ticket
Pclass     1    2    3        1    2    3      1    2    3
Sex
female    94   76  144       94   76  144     94   76  144
male     122  108  347      122  108  347    122  108  347

[2 rows x 30 columns]